/**
 * Created by 1000038 on 2019. 7. 10..
 */


public class ConvertText2Html {
    public static void main(String args[]) {
        String text = "   깎아지는 듯한 가파른 절벽.\n" +
                "    \n" +
                "기어오른다는 생각 같은 것은 할 수조차 없는 험준한 지영을 지니고 있으며, 거센 바람 때문에 짐승은커녕 날개 달린 새들 조차도 쉽게 접근하기 힘든 장소.\n" +
                "    \n" +
                "그러나, 생명체가 쉽사리 살기 힘들 것이라 여겨지는 이 곳엔 놀랍게도 상당한 수의 생명체들이 마을을 이루며 살아가고 있었다.\n" +
                "\n" +
                "새들보다도 강인한 날개와 육체를 지니고 있으며, 가센 돌풍 조차로 자유자제 지배하는 힘을 지닌 종족\n" +
                "\n" +
                "세이렌들 에겐 이런 곳이야 말로, 이상적이면서도 안전한 거처를 마련할 수 있는 장소였다.\n" +
                "\n" +
                "아슬아슬한 벽을 따라서 지어져 있는 통나무를 엮어서 만든 것 같은 집들.\n" +
                "마치 새의 둥지를 연상 시키는 듯 한 그것들 사이를 한 무리의 세이렌들이 천천히 지나가고 있었다.\n" +
                "\n" +
                "“어서 오세요 클라라님. 계곡엔 잘 다녀 오셨나요?”\n" +
                "\n" +
                "수비병으로 보이는 긴 창을 들고 있는 세이렌의 물음에 클라라는 미소를 지어 보이며 대답했다.\n" +
                "\n" +
                "“물론입니다. 간만에 시원한 물에 몸을 담그니 참 좋더군요, 거기다가. 생각지도 못한 수확도 손에 넣었고 말이지요.”\n" +
                "\n" +
                "“수확? 그게 무엇인가요?”\n" +
                "\n" +
                "“후훗 그건 말이지요..”\n" +
                "\n" +
                "그 말과 함께 얼굴에 미소를 지으며 살짝 뒤를 돌아보는 클라라.\n" +
                "그곳에는 한 세이렌의 품에 안겨 있는 소녀의 모습이 있었다.\n" +
                "세이렌과 비슷한 외보를 지니고 있지만, 날개가 달려 있지 않은 존재\n" +
                "\n" +
                "“저건..”\n" +
                "\n" +
                "“네, 인간 소녀 입니다. 규율상 곧바로 처치했어야 했지만.. 일단은 생포해 오기로 했습니다. 아무리 그래도 저희들과 비슷하게 생긴 데다가 나이도 어린 것을 죽이기엔 조금 그래서 말이지요.”\n" +
                "\n" +
                "“흠.. 무슨 뜻인지 잘 알겠습니다.”\n" +
                "\n" +
                "비록 수비병 입장에선 규율을 집행해야 하는 역할이 있긴 하지만, 그녀도 클라라와 마찬가지로 저 인간 소녀에 대해선 단호하게 대처하기가 조금 난감한 것이 사실이었다.\n" +
                "\n" +
                "“인간이라고는 하지만, 우리들과 닮은 암컷이란 종족에 대해선 따로 규율이 있는 것이 아니니 이번엔 일단 조용히 넘어가도록 하겠습니다. 인간의 처분은 클라라님에게 맡기도록 하지요.” \n" +
                "\n" +
                "“감사합니다, 그럼..”\n" +
                "\n" +
                "그렇게 허가가 내려지자 클라라는 아이들과 함께 자신의 집을 향해서 계속해서 날아오르기 시작했다.\n" +
                "\n" +
                "절벽 사이로 불어 오는 거센 바람. 언 듯 비행하기에 불편해 보일지 몰랐으나. 세이렌들에게 이런 바람은 마치 계단의 층계와 같이 자연스럽게 위로 올라갈 수 있도록 도움을 주는 수단에 불과하였다.\n" +
                "\n" +
                "‘그러고 보니 다른 지역의 세이렌 들 사이에선 인간 여성도 단호하게 처치해야 한다는 말이 나왔다 하던데. 뭐, 일단은 상관 없겠지.’\n" +
                "\n" +
                "그런 생각을 하며, 클라라는 마침내 도착한 자신의 집 앞에 천천히 착륙하였다.\n" +
                "\n" +
                "통나무를 깔아서 간단하게 만든 길 위를 걸어서 마찬가지로 나무로 된 문을 열고 안으로 들어가는 클라라와 그 뒤를 따르는 어린 세이렌들.\n" +
                "\n" +
                "집 내부는 나무를 엮어서 만든 듯 허술해 보이는 바깥 과는 달리, 의외로 넓었으며, 인간들의 집과 비슷한 모습을 하고 있었다.\n" +
                "\n" +
                "차이점 이라면 착륙하면서 작게 접었음에도 불구하고 여전히 돌출되어 있는 날개로 인해서, 입구부터 시작해서 가구들 역시 날개를 고려해서 인간들과 비교했을 땐 조금 과할 정도로 넓게 만들어져 있다는 것.\n" +
                "\n" +
                "그렇게 친숙하면서도 한 편으론 이질적인 집 안의 모습을 보면서, 이곳까지 끌려온 인간 소녀.\n" +
                "로제베타는 호기심에 가득한 눈빛으로 천천히 주변을 둘러 보았다.\n" +
                "\n" +
                "‘여기가 세이렌들의 집이구나.. 역시 사람의 외형과 비슷한 만큼 정말 새 같이 둥지에서 사는 건 아니었네.’\n" +
                "\n" +
                "로제베타가 그런 생각을 하고 있을 때, 클라라는 어린 세이렌들을 보며 말하였다.\n" +
                "\n" +
                "“자 그럼 모두들 옷 갈아 입고 식사할 준비 할 것.”\n" +
                "\n" +
                "“네.”\n" +
                "\n" +
                "클라라의 말에 젖은 옷을 갈아입기 위해서 방으로 몰려들어가는 세이렌들.\n" +
                "\n" +
                "그리고.\n" +
                "\n" +
                "“거기 인간… 그러니까 로제베타?”\n" +
                "\n" +
                "“네?”\n" +
                "\n" +
                "“너도 들어가서 갈아 입도록 해, 더럽기도 하고, 그런 인간의 복장으로 있으면 괜히 눈에 띌 태니까.”\n" +
                "\n" +
                "자신이 입고 있는 것과 비슷한, 붉은 빛 드레스를 연상시키는 의복을 건네면서 말하는 클라라.\n" +
                "\n" +
                "“아.. 네, 감사합니다.”\n" +
                "\n" +
                "이에 로제베타는 고개를 꾸벅 숙이며 이것을 받았다.\n" +
                "\n" +
                "노예 상인들에게 당한지 겨우 며칠이 지나지 않았기에 이런 식의 호의에 대해선 어쩐지 찝찝한 기분이 들긴 했지만.\n" +
                "확실히 먼지가 잔뜩 묻어 지저분해진 여행자 복장을 하고 있는 것 보다는, 그 편이 낮겠다는 생각을 하면서 로제베타는 클라라의 말에 따라 조심스럽게 방 안으로 들어갔다.\n" +
                "\n" +
                "탈의실을 연상 시키는 듯한 그곳.\n" +
                "안에선 어린 세이렌들이 물에 흠뻑 젖어있던 옷을 벗어 던진 후, 새 옷으로 갈아입는 중이었으며, 이를 보면서 로제베타는 어쩐지 조금 얼굴이 빨개지는 것 같은 느낌이 들기 시작했다.\n" +
                "\n" +
                "일단은 같은 여자.. 라 할 수 있긴 했지만 그럼에도 딱 봤을 때 아름답다 라고 할 수 있는 모습을 지니고 있는 세이렌들 사이에 있자니 공연이 움츠러드는 것만 같은 기분이 들었기 때문이다\n" +
                "\n" +
                "‘이.. 일단 빨리. 갈아 입어야지.’\n" +
                "\n" +
                "이런 상황에선 아무래도 오래 있기 조금 그런 만큼, 로제베타는 서둘러 옷을 벗기 시작했다.\n" +
                "\n" +
                "그런데..\n" +
                "\n" +
                "“…?”\n" +
                "\n" +
                "갑자기 조용해진 방 안, 이에 로제베타는 뭔가 이상함을 느끼면서 천천히 주변을 둘러보았다.\n" +
                "\n" +
                "그리고 그곳엔..\n" +
                "\n" +
                "‘…뭐..뭐지?..’\n" +
                "\n" +
                "어느 순간부터 옷을 벗고 있는 자신을 신기한 눈빛으로 바라보는 세이렌들.\n" +
                "이에 로제베타는 대체 이게 무슨 상황일까 하는 생각이 들었지만 이내, 그녀는 스스로 그 답을 찾아내었다.\n" +
                "\n" +
                "‘아.. 그런 건가?..’\n" +
                "\n" +
                "비록 인간과 비슷하다고는 하지만 이들은 세이렌 이었다. 엄밀히 둘은 다른 종족으로. 그들 입장에서 로제베타는 태어나서 처음 보는 생물체.\n" +
                "그런 것이 자신들 앞에서 옷을 갈아있고 있는 모습은 그 자체로 신기하게 보였을 것이다.\n" +
                "\n" +
                "‘아무리 그래도 그렇지.. 이런 식으로 구경거리가 될 줄이야..’\n" +
                "\n" +
                "하지만 그런 세이렌들의 입장과는 무관하게 로제베타 입장에선 그저 이 상황이 부끄러울 뿐이었기에, 그녀는 서둘러 옷을 갈아 입었다.\n" +
                "\n" +
                "날개를 고려하여 만들어졌기 때문에 등쪽이 뻥 뚫려 있어 이상한 기분이 드는 옷이긴 했지만. 의외로 사이즈는 꼭 맞았으며, 이에 로제베타는 조금 안심하면서 옆에 있는 거울을 들여다 보았다.\n" +
                "\n" +
                "‘그러고 보니 이렇게 내 모습을 직접 거울 앞에서 보는 건 이 세계에 온 후엔 처음이구나..’\n" +
                "\n" +
                "거울에 비친 로제베타의 모습은 그녀가 설정한 캐릭터의 모습.\n" +
                "이곳에 오기 전, 계곡에서 몸을 씻은 덕분에 비교적 깨끗하였으며 얼굴 역시 언니들의 도움을 받아 세밀하게 조작해 만들어낸 것인 만큼, 거울에 비치고 있는 지금의 로제베타의 모습은 눈에 띌 정도의 미소녀였지만 그럼에도 그 동안 심신적으로 고생을 많이 한 탓에 상당히 초췌해 보였다.\n" +
                "\n" +
                "‘이게 나.. 장미.. 아니 로제베타란 이름의 내가 지니고 있는 모습..’\n" +
                "\n" +
                "적갈색 머리칼과 푸른 눈동자. 그리고 약간 창백한 느낌이 드는 백색 피부.\n" +
                "본래 모습과는 완전히 다르게 변한 자신을 천천히 지켜보면서 드는 위화감과 약간의 친밀감.\n" +
                "두 가지 감정을 동시에 느끼며 로제베타가 한동안 거울을 바라보고 있던 그때였다.\n" +
                "\n" +
                "“인간, 다 갈아 입었으면 식사하러 가자.”\n" +
                "\n" +
                "“…네, 알겠습니다.”\n" +
                "\n" +
                "세이렌의 말에 로제베타는 천천히 거울에서 시선을 돌린 후 세이렌들의 뒤를 따라 방을 나섰다.\n" +
                "\n" +
                "*\n" +
                "\n" +
                "“흠.. 확실히 그렇게 차려 입으니까 날개를 제외하곤 크게 티가 안 나는 구나.”\n" +
                "\n" +
                "클라라가 로제베타를 바라보며 말하였고 다른 세이렌들 역시 동의의 뜻을 표하였다.\n" +
                "아까 전에 옷을 갈아 입을 때는 잘 몰랐지만, 이렇게 세이렌들의 복장을 하고 있는 로제베타의 모습을 보고 있자니 자신들과 크게 다르지 않다는 생각이 들기 시작했다.\n" +
                "\n" +
                "비록 날개가 없다는 사실은 그들에게 있어서 다리가 없는 것과 비슷한 케이스인 만큼 평범하게 보기엔 여전히 무리가 있긴 했지만.\n" +
                "\n" +
                "“좋아, 그럼 옷도 다 갈아 입었으니 식사를 하도록 할까?”\n" +
                "\n" +
                "“네.”\n" +
                "\n" +
                "클라라가 밝은 목소리로 말하였고, 이에 세이렌들은 환한 목소리로 대답한 뒤 옆쪽에 있는 넓은 탁자에 자리를 잡고 앉기 시작했다.\n" +
                "\n" +
                "그리고, 그런 그들의 눈치를 보며, 로제베타 역시 한쪽 구석에 조용히 자리를 잡았지만 그러면서도 그녀는 내심 걱정이 앞서기 시작했다.\n" +
                "\n" +
                "‘세이렌.. 비록 인간과 비슷하게 생겼지만 어쩌면 이들도 늑대 인간 같이 사람을 잡아 먹거나 하지 않을까?’\n" +
                "\n" +
                "설마 식탁 위에 노릇노릇 구워진 인간이 나오거나 하면 어떻게 해야 할지 걱정하며 마음을 졸이는 로제베타.\n" +
                "\n" +
                "그리고 잠시 후, 클라라가 쟁반에 담긴 요리들을 식탁 위에 차려놓기 시작했다.\n" +
                "\n" +
                "조금 특이하게 생긴 채소로 만든 샐러드와, 들짐승을 사용한 것 같이 보이는 고기요리\n" +
                "그리고 김이 모락모락 나는 스프.\n" +
                "\n" +
                "다행히 대놓고 사람 머리통이 나오거나 하지 않았다는 사실에 감사하면서, 로제베타는 세이렌들이 식사를 시작하는 모습을 본 뒤 그녀 역시 조심스럽게 식기를 들었다.\n" +
                "\n" +
                "식기는 나이프와 포크 그리고 숟가락.\n" +
                "젓가락은 당연히 없었으며, 나이프와 포크도 평범한 것들과는 달리 마치 대놓고 창과 검을 연상시키게 하는 모양이었지만, 로제베타는 이를 이용해서 최대한 조심스럽게 요리를 먹기 시작했다.\n" +
                "\n" +
                "‘..맛있다..’\n" +
                "\n" +
                "요리가 입 안에 들어온 후 이를 씹으면서 처음으로 로제베타의 머리 속에 든 생각.\n" +
                "\n" +
                "무엇으로 만든 것인지는 잘 모르겠지만 지금의 그녀에게 이는 그다지 중요한 사실이 아니었다.\n" +
                "\n" +
                "이 세계에 온 이후, 일주일 만에 처음으로 먹는 제대로 된 식사에 로제베타는 어쩐지 서글픈 감정이 들면서 순간적으로 눈물이 팽 돌기 시작하였지만, 그녀는 이를 억지로 꾹 눌러 참았다.\n" +
                "\n" +
                "그녀를 제외한 다른 이들이 모두 밝은 모습으로 식사를 즐기고 있는 자리에서 눈물을 보일 수는 없었기 때문이다.\n" +
                "\n" +
                "‘울어선 안되.. 적어도 이 자리에서만큼은..’\n" +
                "\n" +
                "그렇게 목이 메이는 감각을 느끼면서도 열심히 식사를 계속하는 로제베타. 그리고 한쪽에서 식사를 하고 있던 클라라는 그런 로제베타의 모습을 조용히 지켜보았다.\n" +
                "\n" +
                "‘요리가 입에 맞지 않는 것은 아닌 듯 하고..’\n" +
                "\n" +
                "그런 생각을 하면서 클라라는 일단은 모른 적 고기를 썬 후 입에 넣었다.\n" +
                "\n" +
                "*\n" +
                "\n" +
                "로제베타의 입장에선 어렵사리 식사가 끝난 이후, 어린 세이렌들은 각자의 집으로 돌아가기 시작하였다.\n" +
                "\n" +
                "“고맙습니다 클라라님.”\n" +
                "\n" +
                "“그럼 다음에 또 봐요.”\n" +
                "\n" +
                "선생님에게 인사를 하는 학생들과 같이 손을 흔든 후, 날개를 펴고 사방으로 흩어지는 세이렌들.\n" +
                "\n" +
                "그렇게 모두가 떠난 후, 조용해진 집에는 클라라와 로제베타 단 두 사람 만이 남게 되었다.\n" +
                "아까 전의 시끌벅적 할 때와는 다른, 어색한 침묵이 감도는 분위기.\n" +
                "\n" +
                "그리고 이런 상황 속에서 먼저 침묵을 깬 쪽은 클라라였다.\n" +
                "\n" +
                "“괜찮으면 이야기를 좀 나눌 수 있을까?”\n" +
                "\n" +
                "“ㄴ..네..”\n" +
                "\n" +
                "클라라의 물음에 떨리는 목소리로 대답하는 로제베타.\n" +
                "비록 아까 보다는 안정되긴 했지만. 그럼에도 로제베타의 마음 속에는 이 클라라라는 존재, 아니 세이렌이라는 존재들에 대한 경계심이 남아 있었다.\n" +
                "\n" +
                "이대로 잡아 먹히는 것이 아닐 까? 아니면 그 노예상인 들 에서와 같이 어딘가로 팔아 넘겨 지거나 하지 않을까 하는 일말의 두려움이.\n" +
                "\n" +
                "그리고, 그렇게 불안감을 내비치고 있는 로제베타의 모습을 보면서 클라라의 입가엔 가볍게 미소가 지어졌다.\n" +
                "\n" +
                "“그렇게 걱정 하지마, 널 어떻게 하겠다는 것이 아니라 단순히 가벼운 호기심 때문이니까.”\n" +
                "\n" +
                "비록 인간이긴 하지만, 어쩐지 자신을 처음 만났을 때의 어린 세이렌들 과 크게 다르지 않다는 생각을 하면서 클라라는 부드러운 목소리로 말하였고, 이에 로제베타 역시 긴장이 풀린 듯 살짝 미소를 지어 보였다.\n" +
                "\n" +
                "“그럼, 우선 몇 가지만 물어 보도록 할게. 입고 있던 복장으로 봤을 때 넌 이 지역의 인간은 아닌 것 같은데. 어디서 온 거니?”\n" +
                "\n" +
                "“그건..”\n" +
                "\n" +
                "문득 본래 집주소 같은 것이 떠올랐지만, 이내 로제베타는 그런 것을 말해 봐야 의미가 없다는 사실을 인지한 후 조심스럽게 입을 열었다.\n" +
                "\n" +
                "“죄송해요, 어렸을 때부터 이리저리 떠돌아 다녀서 정확히는 잘 모르겠지만.. 일단 동방 지역에서 왔다는 것은 분명해요.”\n" +
                "\n" +
                "“그렇구나.. 요컨대 상인들 무리 같은 곳에서 자랐단 말이지? 과연, 인간 임에도 우리들의 언어를 자연스럽게 구사 할 때부터 조금은 예상 했는데.. 그런 배경이 있었어. 하지만 역시 조금 놀라운 걸. 인간들의 언어 중 우리들의 것과 비슷한 게 있다는 사실은 들어 본 적이 있지만. 이 정도로 잘 하다니 말이야.”\n" +
                "\n" +
                "“네?.. 아.. 네. 감사합니다.”\n" +
                "\n" +
                "문득 클라라의 말에 로제베타는 조금 의아한 생각이 들긴 했지만. 이내 이 말에 대해선 그다지 깊게 생각하지 않은 체 그저 어찌어찌 잘 넘어갔다는 사실에 속으로 안도의 한숨을 내 쉬었다.\n" +
                "\n" +
                "아무리 그래도 여기서 다른 세상에서 온 존재 같은 믿어주기 힘든 소리를 늘어 놓을 수는 없었기 때문이다.\n" +
                "\n" +
                "“좋았어, 그럼 다음 질문. 괜찮다면, 우리를 만나기 전에 무슨 일이 있었는지 말해줄 수 있겠니?”\n" +
                "\n" +
                "클라라의 말에 로제베타는 떠올리는 것 조차 힘겨운, 악몽 같았던 일주일의 기억이 다시금 그녀를 난도질 하면서 스치고 지나가는 것 같은 기분이 들기 시작했지만, 이내 이를 다잡은 후 힘겹게 말을 하기 시작했다.\n" +
                "\n" +
                "습격 당한 마을, 노예 상인들에게 속아 팔려갈 뻔 했던 일. 그리고 늑대인간들의 공격과 추락..\n" +
                "\n" +
                "말을 하면서도 그때의 기억이 자신의 목을 조르는 듯 한 감각이 느껴질 정도였지만. \n" +
                "그럼에도 로제베타는 정신이 깎여 나가는 기분을 느끼면서 까지 이를 다 말 하였다.\n" +
                "\n" +
                "비록 만난 시간은 얼마 되지 않았으며, 이 뒤에 무엇이 있을지 조차 아직은 알 수 없었지만. 적어도 지금 로제베타는 클라라에게 은혜를 입었다는 생각을 지니고 있었기 때문에, 이런 식으로 라도 그것에 보답해야 한다 여기고 있었다.\n" +
                "\n" +
                "그렇게 로제베타의 이야기가 끝난 후, 클라라는 잠시 동안 충격을 받은 표정으로 무거운 침묵을 유지하였다.\n" +
                "\n" +
                "비록 아주 자세하게 까지는 로제베타가 이야기 하지 못했지만, 그것을 제외 하더라도 그녀의 입에서 나온 것은 어린 소녀가 감당하기엔 너무나도 끔직한 일들이었기 때문이다.\n" +
                "\n" +
                "종족을 떠나서, 클라라는 눈 앞에 있는 소녀에 대한 연민이 커져가는 것을 느끼며, 어렵게 입을 열었다.\n" +
                "\n" +
                "“힘들었.. 겠구나. 정말로.”\n" +
                "\n" +
                "“..네..”\n" +
                "\n" +
                "이 어린 소녀를 끌어안고 위로해 주고 싶다는 생각이 들었지만 어떻게든 이를 억누른 후, 클라라는 최대한 침착함을 유지하기 위해 애쓰며 다시금 조용한 목소리로 물었다.\n" +
                "\n" +
                "“그럼.. 마지막으로 한가지만 더 질문 할게.”\n" +
                "\n" +
                "그 말을 한 뒤 한번 더 감정을 조절할 후, 클라라는 로제베타의 얼굴을 똑바로 바라보며 물었다.\n" +
                "\n" +
                "“넌 앞으로 어떻게 할 생각이니?”\n" +
                "\n" +
                "앞의 질문들과는 달리 상당한 무게가 달려 있는 물음이었다.\n" +
                "경우에 따라선 그녀에 대한 처분이 결정 될지도 모르는 질문.\n" +
                "\n" +
                "그리고, 그런 클라라의 질문에 대한 로제베타의 대답은.\n" +
                "\n" +
                "“그거에 대한 대답으로.. 저도 한가지만 질문 할게요..”\n" +
                "\n" +
                "그렇게 말하는 로제베타의 눈가엔 살짝 눈물이 고이기 시작했다.\n" +
                "마치 길을 잃고 홀로 버려진 작은 아기 새와 같은 표정을 지은 체.\n" +
                "그녀는 어렵게 입을 열었다.\n" +
                "\n" +
                "“전.. 앞으로 어떻게 되는 건가요?”";

        String result = Text2Html.make(text);
        System.out.print(result);
    }
}
